<h1 style="color:green; font-size:30px; font-weight:700; text-align:center">
    <u><b>Part 3: MySQL DB</b></u>  
</h1> 

<p></p> 
<strong> Author:</strong> Gurtej Bains <br> 
<strong> Data Source:</strong> https://www.imdb.com/interfaces/  <br> 
<strong> Last Updated: </strong>  <br>  
<strong> Problem Statement:</strong> <br>

<h1 style="color:green"><b>Importing Modules</b> </h1>

## Import Libraries

In [1]:
# import libraries  

# Numpy
import numpy as np

# Pandas
import pandas as pd

# MatPlotLib
import matplotlib.pyplot as plt

# Seaborn
import seaborn as sns

# MissingNo
import missingno as msno

# SQL related 
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:root@localhost/books_db"

from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

# suppress warnings
import warnings
warnings.filterwarnings("ignore")

# for directory 
import os

# TQDM
import tmdbsimple as tmdb
from tqdm.notebook import tqdm_notebook

In [2]:
engine = create_engine(connection_str)
engine

Engine(mysql+pymysql://root:***@localhost/books_db)

## Color class

In [3]:
# Color class to make print look pretty  
class color:
   PURPLE = '\033[95m'
   CYAN = '\033[96m'
   DARKCYAN = '\033[36m'
   BLUE = '\033[94m'
   GREEN = '\033[92m'
   YELLOW = '\033[93m'
   RED = '\033[91m'
   BOLD = '\033[1m'
   UNDERLINE = '\033[4m'
   END = '\033[0m'

print(color.BOLD + 'Hello, World!' + color.END)

Hello, World!

## Create Database

In [4]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

<h1 style="color:green"><b>Importing Data</b> </h1>

## basics data

In [5]:
# read file 
basics = pd.read_csv(r"C:\Users\gurte\OneDrive\All About Learning\Coding Dojo\Learning Material\05 Projects\Project 3\imdb_movie_analysis\clean data\title_basics.csv.gz")

# keep select columns
basics=basics.drop(columns=['titletype', 'originaltitle', 'isadult', 'endyear'])

# qa
basics.head()

,tconst,primarytitle,startyear,runtimeminutes,genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002,126,Drama

## ratings data

In [6]:
ratings = pd.read_csv(r"C:\Users\gurte\OneDrive\All About Learning\Coding Dojo\Learning Material\05 Projects\Project 3\imdb_movie_analysis\clean data\title_ratings.csv.gz")
ratings.head()

      tconst  averagerating  numvotes
0  tt0000001            5.7      1953
1  tt0000002            5.8       264
2  tt0000005            6.2      2587
3  tt0000006            5.1       177
4  tt0000007            5.4       812

## TMDB API data

In [7]:
tmdbi_2000 = pd.read_json(r"C:\Users\gurte\OneDrive\All About Learning\Coding Dojo\Learning Material\05 Projects\Project 3\imdb_movie_analysis\clean data\tmdb_api_results_2000.json")
tmdbi_2000.shape

(1, 1)

In [8]:
tmdbi_2001 = pd.read_json(r"C:\Users\gurte\OneDrive\All About Learning\Coding Dojo\Learning Material\05 Projects\Project 3\imdb_movie_analysis\clean data\tmdb_api_results_2001.json")
tmdbi_2001.shape

(1, 1)

<h1 style="color:green"><b>Normalize Data</b> </h1>

In [9]:
basics

,tconst,primarytitle,startyear,runtimeminutes,genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002,126,Drama
...,...,...,...,...,...
85493,tt9914942,Life Without Sara Amat,2019,74,Drama
85494,tt9915872,The Last White Witch,2019,97,"Comedy,Drama,Fantasy"
85495,tt9916170,The Rehearsal,2019,51,Drama
85496,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller"
85497,tt9916362,Coven,2020,92,"Drama,History"

In [10]:
## showing the lists are really strings
basics.loc[0,'genres']

'Comedy,Fantasy,Romance'

In [11]:
# split to parse the string 
new_genres = basics["genres"].str.split(",")

# creating new dataframe 
temp_df = pd.DataFrame({'genres': [val for sublist in new_genres for val in sublist]})

# rename the index 
temp_df.index.names = ['id']

# qa 
temp_df.head(2)

     genres
id
0    Comedy
1   Fantasy

## Create genres table/dataframe

In [12]:
q = """
select row_number() over (order by genres) as genre_id, genres
from (SELECT distinct genres
        from temp_df 
        order by 1) temp 
order by 1

"""
genres = pysqldf(q)
genres

    genre_id      genres
0          1      Action
1          2       Adult
2          3   Adventure
3          4   Animation
4          5   Biography
5          6      Comedy
6          7       Crime
7          8       Drama
8          9      Family
9         10     Fantasy
10        11   Game-Show
11        12     History
12        13      Horror
13        14       Music
14        15     Musical
15        16     Mystery
16        17        News
17        18  Reality-TV
18        19     Romance
19        20      Sci-Fi
20        21       Short
21        22       Sport
22        23   Talk-Show
23        24    Thriller
24        25         War
25        26     Western

## Create title_genres table/dataframe

In [13]:
# Modify the basics dataframe
basics_exploded = basics.assign(genres_new=basics['genres'].str.split(',')).explode('genres')
basics_exploded = basics_exploded.explode('genres_new')

# reset index 
basics_exploded = basics_exploded.reset_index(drop=True)

# qa
basics_exploded.head()

,tconst,primarytitle,startyear,runtimeminutes,genres,genres_new
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Comedy
1,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Fantasy
2,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Romance
3,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,Drama
4,tt0069049,The Other Side of the Wind,2018,122,Drama,Drama

In [21]:
# Merge datasets to make new datafram 
title_genres = pd.merge(basics_exploded, genres, how='inner', left_on='genres_new', right_on='genres')

# Dro punwanted columns 
title_genres = title_genres.drop(columns=['primarytitle', 'startyear', 'runtimeminutes', 'genres_x', 'genres_new', 'genres_y'])

# reset index 
title_genres = title_genres.reset_index(drop=True)

# qa
title_genres[title_genres['tconst']=='tt0035423']

          tconst  genre_id
0      tt0035423         6
25152  tt0035423        10
28965  tt0035423        19

In [22]:
title_genres.head()

      tconst  genre_id
0  tt0035423         6
1  tt0088751         6
2  tt0100275         6
3  tt0108549         6
4  tt0118652         6